package Day06;

public class Day06_과제 {
	
	/*
	 * 
	 * 	 이메일 제출 : itdanja@kakao.com
		
		회원제 게시판 [ 회원 클래스 , 게시물 클래스 , 프로그램 클래스 ]
			// 회원 : 아이디 , 비밀번호 , 성명 
			// 게시물 : 제목 , 내용 , 작성자 , 작성일 , 조회수
			// 배열보다는 Arraylist 클래스 사용 
		1.초기메뉴
			1. 회원가입
			2. 로그인 
			3. 종료 
		2.로그인시 메뉴 
			모든 게시물 출력 
			1. 글쓰기 2. 글보기 3.글삭제 4.회원정보수정 5.로그아웃 
	
				1. 글쓰기 조건 
					제목 , 내용 , 작성자[로그인아이디] , 작성일[date] , 조회수
				2. 글보기
					1.선택받은 번호의 게시물 출력 
					2.선택받은 번호의 게시물 조회수 증가 
				3. 글삭제 
					1. 로그인된 아이디와 작성자와 동일한경우만 삭제 가능 
				4. 회원정보수정 
					1. 비밀번호 수정 
					2. 회원탈퇴 
				5. 로그아웃시 
					초기메뉴로 ~

	 * 
	 */
	

}
